benchmark_result/bench_result_hadware_evol/fio/xen_4_12_4/vm4/fio_result/round2/rand_read_throughput
rand_read_throughput: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_read_throughput: (groupid=0, jobs=4): err= 0: pid=17056: Mon Jun 24 03:29:17 2024
   read: IOPS=2208, BW=2213MiB/s (2321MB/s)(130GiB/60011msec)
    slat (usec): min=101, max=26009, avg=1641.98, stdev=2218.99
    clat (usec): min=571, max=300747, avg=114031.76, stdev=22122.47
     lat (msec): min=3, max=302, avg=115.70, stdev=22.34
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   79], 10.00th=[   93], 20.00th=[  103],
     | 30.00th=[  108], 40.00th=[  112], 50.00th=[  115], 60.00th=[  120],
     | 70.00th=[  124], 80.00th=[  129], 90.00th=[  136], 95.00th=[  144],
     | 99.00th=[  169], 99.50th=[  190], 99.90th=[  220], 99.95th=[  245],
     | 99.99th=[  284]
   bw (  KiB/s): min=359334, max=1224662, per=25.10%, avg=568754.20, stdev=75760.69, samples=480
   iops        : min=  350, max= 1195, avg=555.10, stdev=73.99, samples=480
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.03%, 50=1.99%
  lat (msec)   : 100=15.20%, 250=82.92%, 500=0.05%
  cpu          : usr=6.63%, sys=29.23%, ctx=143975, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=132553,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2213MiB/s (2321MB/s), 2213MiB/s-2213MiB/s (2321MB/s-2321MB/s), io=130GiB (139GB), run=60011-60011msec

Disk stats (read/write):
  xvda: ios=1094264/11, merge=0/12, ticks=3288172/28, in_queue=3212748, util=99.77%